Update architecture doc
